table=[2,3,4,5];
%% 奇异值为2，3，4，5时的参数
% 记录100
CR100=[126.91,84.57,63.40,50.70,];
PRD100=[11.46,9.08,7.51,6.16];
QS100=[11.08,9.31,8.45,8.23];

% 记录101
CR101=[146.56,97.66,73.21,58.54];
QS101=[9.77,8.69,7.64,7.54];

% 记录103
CR103=[135.56,90.34,67.73,54.158];
PRD103=[14.91,12.15,9.04,7.46];
QS103=[9.09,7.43,7.49,7.26];

% 记录117
CR117=[165.64,110.37,82.74,66.15];
QS117=[27.56,21.63,19.25,19.49];

% 记录119
CR119=[140.26,93.47,70.07,56.03];
PRD119=[15.97,8.03,6.87,5.989];
QS119=[8.78,11.64,10.21,9.36];

%% 对比
figure(1)
plot(table,CR100);
hold on
plot(table,CR101);
hold on
plot(table,CR103);
hold on
plot(table,CR117);
hold on
plot(table,CR119);

figure(2)
plot(table,QS100);
hold on
plot(table,QS101);
hold on
plot(table,QS103);
hold on
plot(table,QS117);
hold on
plot(table,QS119);